# Combining and Exporting Data

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
path = r'C:\Users\aaron\OneDrive\Documents\CF Analysis 4'

In [6]:
df_prods = pd.read_csv(os.path.join(path, '2 Data', 'Prepared Data', 'products_cleaned.csv'), index_col = False)

Part 3

In [14]:
#Importing the Combined dataframe
df_opc = pd.read_pickle(os.path.join(path, '2 Data', 'Prepared Data', 'orders_products_combined.pkl'))

Part 4

In [22]:
# checking shape
df_opc.shape

(32434489, 9)

Part 5

In [26]:
# Figuring out how to combine the data sets
df_prods.shape

(49672, 5)

In [28]:
df_opc.head()

,order_id,user_id,number_of_consecutive_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [30]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [36]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [38]:
df_opc.describe()

,order_id,user_id,number_of_consecutive_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
count,3.243449e+07,3.243449e+07,3.243449e+07,3.243449e+07,3.243449e+07,3.035642e+07,3.243449e+07,3.243449e+07,3.243449e+07
mean,1.710749e+06,1.029372e+05,1.714205e+01,2.738818e+00,3.471306e+07,1.110407e+01,2.557634e+04,1.735653e+07,5.896975e-01
std,9.873007e+05,5.946648e+04,1.753504e+01,2.090049e+00,1.397917e+11,8.778914e+00,1.409669e+04,9.884763e+10,4.918886e-01
min,2.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00
25%,8.559430e+05,5.142100e+04,5.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,1.353000e+04,3.000000e+00,0.000000e+00
50%,1.711048e+06,1.026110e+05,1.100000e+01,3.000000e+00,1.300000e+01,8.000000e+00,2.525600e+04,6.000000e+00,1.000000e+00
75%,2.565514e+06,1.543910e+05,2.400000e+01,5.000000e+00,1.600000e+01,1.500000e+01,3.793500e+04,1.100000e+01,1.000000e+00
max,3.421083e+06,2.062090e+05,9.900000e+01,6.000000e+00,5.629500e+14,3.000000e+01,4.968800e+04,5.629500e+14,1.000000e+00

I'm going to merge the data sets because both of them only share one column. I'm also going to use an inner join because both data sets have the same max product id number

In [41]:
df_merged = df_prods.merge(df_opc, on = 'product_id', indicator = True)

Part 6

In [45]:
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

The merged data set did losing 29,630 rows, but that only comes out to .09% of the data set.

Part 7

In [54]:
# Exporting the merged data
df_merged.to_pickle(os.path.join(path, '2 Data','Prepared Data', 'ords_prods_merge'))